src/Documents/ВводИзменениеОстатка/ВводИзменениеОстатка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводИзменениеОстатка</name>
  <registerRecords>AccountingRegister.ЖурналОпераций</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеОборотыБюджета</registerRecords>
  <attributes>
    <name>ВалютаОперации</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектУчета</name>
    <type>
      <types>Characteristic.ВидыСубконто</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОперации</name>
    <comment>(Инф.)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделУчета</name>
    <type>
      <types>ChartOfAccountsRef.РазделыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНовогоОстатка</name>
    <comment>(Инф.)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНовогоОстаткаПроцентов</name>
    <comment>(Инф.)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДохода</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНовогоОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНовогоОстаткаПроцентов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРасхода</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФинансоваяЦель</name>
    <type>
      <types>CatalogRef.ФинансовыеЦели</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

src/AccountingRegisters/ЖурналОпераций/ЖурналОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>ЖурналОпераций</name>
  <chartOfAccounts>ChartOfAccounts.РазделыУчета</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделВалютнойОперации</name>
    <type>
      <types>ChartOfAccountsRef.РазделыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектВалютнойОперации</name>
    <type>
      <types>Characteristic.ВидыСубконто</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВалютнойОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВалютнойОперации</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

src/Enums/ТипыСчетов/ТипыСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСчетов</name>
  <enumValues>
    <name>Наличность</name>
  </enumValues>
  <enumValues>
    <name>БанковскаяКартаДебетовая</name>
  </enumValues>
  <enumValues>
    <name>БанковскаяКартаКредитная</name>
  </enumValues>
  <enumValues>
    <name>БанковскаяКартаУниверсальная</name>
  </enumValues>
  <enumValues>
    <name>БанковскийСчет</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйКошелек</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ФинансовыеЦели/ФинансовыеЦели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФинансовыеЦели</name>
  <predefined>
    <items>
      <name>ОбщиеНакопления</name>
      <description>Общие накопления (без указания цели)</description>
    </items>
  </predefined>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеФинансовойЦели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Срок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНакопления</name>
    <type>
      <types>DocumentRef.Доход</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/ChartsOfAccounts/РазделыУчета/РазделыУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>РазделыУчета</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Деньги</name>
      <description>Деньги</description>
      <code>100</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>СвободныеДеньги</name>
        <description>Свободные деньги</description>
        <code>100.01</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>Накопления</name>
        <description>Накопления</description>
        <code>100.10</code>
        <accountType>ActivePassive</accountType>
      </childItems>
    </items>
    <items>
      <name>Имущество</name>
      <description>Имущество</description>
      <code>200</code>
    </items>
    <items>
      <name>Долги</name>
      <description>Долги</description>
      <code>500</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>ОсновныеСуммыДолгов</name>
        <description>Основные суммы долгов</description>
        <code>500.10</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>ПроцентыПоДолгам</name>
        <description>Проценты по долгам</description>
        <code>500.20</code>
        <accountType>ActivePassive</accountType>
      </childItems>
    </items>
    <items>
      <name>Капитал</name>
      <description>Капитал</description>
      <code>900</code>
      <accountType>Passive</accountType>
    </items>
  </predefined>
  <attributes>
    <name>ЗаголовокДляСубконтоПоДебету</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокДляСубконтоПоКредиту</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfAccounts>

src/Documents/ВводИзменениеОстатка/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Перем ДополнительныеПараметрыНаКлиенте Экспорт;


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПодготовитьФормуНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	УправлениеФормой();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	// Общий функционал перед записью документов
	ОбслуживаниеДокументовКлиент.ПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Записана операция", Новый Структура("Дата, ВидДокумента, Ссылка, ЭтоШаблон, ВладелецФормы", 
			Объект.Дата, "ВводИзменениеОстатка", Объект.Ссылка, Объект.ЭтоШаблон, ?(ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения"), ВладелецФормы.УникальныйИдентификатор, Неопределено)));
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Общий функционал перед записью документов
	ОбслуживаниеДокументовКлиент.ПередЗакрытием(ЭтаФорма, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ЗаполнитьТекущимиОстатками();
	
КонецПроцедуры

&НаКлиенте
Процедура КошелекПриИзменении(Элемент)
	
	КошелекПриИзмененииСервер();

КонецПроцедуры

&НаКлиенте
Процедура ФинансоваяЦельПриИзменении(Элемент)
	
	ФинцельПриИзмененииСервер();

КонецПроцедуры

&НаКлиенте
Процедура СубконтоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОбслуживаниеСправочниковКлиент.РасширенноеПолучениеДанныхОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий", Заголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаНовогоОстатка1ПриИзменении(Элемент)
	
	НовыйОстатокКошелька   = ТекущийОстаток + Объект.СуммаНовогоОстатка - ТекущийОстатокФинцели;
	
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	Если Не ЗначениеЗаполнено(Объект.ОбъектУчета) Тогда
		Объект.ОбъектУчета = ПользовательскиеНастройкиДеньгиСервер.ОсновнойКошелек();
	КонецЕсли;
	
	ВалютаОперации = ?(ЗначениеЗаполнено(Объект.ОбъектУчета), Объект.ОбъектУчета.Валюта, ВалютаУчета);
	
	ЗаполнитьТекущимиОстатками();
	
	// Общие настройки форм элементов документов
	РаботаСФормамиДокументов.ФормаДокументаПриСозданииНаСервере(ЭтаФорма);
	
	// Настройка внешнего вида
	РаботаСФормамиДокументовКлиентСервер.ОбновитьЭлементыФормыПоСостояниюОперации(ЭтотОбъект);
	УправлениеФормой();

КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()

	ЭтоДолг       = ТипЗнч(Объект.ОбъектУчета) = Тип("СправочникСсылка.Долги");
	ЭтоКошелек    = ТипЗнч(Объект.ОбъектУчета) = Тип("СправочникСсылка.КошелькиИСчета");
	ЭтоНакопление = ЭтоКошелек И Объект.ОбъектУчета.ИспользоватьДляНакоплений;
	ВозможенОтрицательныйОстаток = ЭтоКошелек И (Объект.ОбъектУчета.ТипСчета = Перечисления.ТипыСчетов.БанковскаяКартаДебетовая
		 		ИЛИ Объект.ОбъектУчета.ТипСчета = Перечисления.ТипыСчетов.БанковскаяКартаКредитная
				ИЛИ Объект.ОбъектУчета.ТипСчета = Перечисления.ТипыСчетов.БанковскаяКартаУниверсальная
				ИЛИ Объект.ОбъектУчета.ТипСчета = Перечисления.ТипыСчетов.БанковскийСчет);
	
	ТекстПодсказкиПоОстатку = "";
	//Элементы.ГруппаФинансоваяЦельОстаток.Видимость = ЭтоНакопление;
	
	Если ЭтоДолг Тогда
		
		Элементы.ГруппаСтраницОстатков.ТекущаяСтраница = Элементы.СтраницаОстатокДолга;
		ТекстПодсказкиПоОстатку = НСтр("ru = 'Положительный остаток - долг контакта нам, отрицательный - наш долг контакту'") ;
		
	ИначеЕсли ЭтоНакопление Тогда
		
		Элементы.ГруппаСтраницОстатков.ТекущаяСтраница = Элементы.СтраницаОстатокНакоплений;
		
	Иначе
		
		Элементы.ГруппаСтраницОстатков.ТекущаяСтраница = Элементы.СтраницаОстатокПрочий;
		Если ВозможенОтрицательныйОстаток Тогда
			ТекстПодсказкиПоОстатку = НСтр("ru = 'Положительный остаток - деньги в наличии, отрицательный - долг банку'") ;
		КонецЕсли;
		
	КонецЕсли;
	
	РаботаСФормамиДокументовКлиентСервер.ОбновитьСостояниеОперации(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура КошелекПриИзмененииСервер()

	ВалютаОперации = ?(ЗначениеЗаполнено(Объект.ОбъектУчета), Объект.ОбъектУчета.Валюта, ВалютаУчета);
	ЭтоНакопления = ТипЗнч(Объект.ОбъектУчета) = Тип("СправочникСсылка.КошелькиИСчета") И Объект.ОбъектУчета.ИспользоватьДляНакоплений;
	
	Если ЭтоНакопления Тогда
		Объект.ФинансоваяЦель = ФинансоваяЦельКошелька(Объект.ОбъектУчета);
	КонецЕсли; 
	
	ЗаполнитьТекущимиОстатками();
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ФинцельПриИзмененииСервер()

	ЗаполнитьТекущимиОстатками();
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущимиОстатками()

	ТекущийОстаток          = 0;
	ТекущийОстатокПроцентов = 0;
	ТекущийОстатокФинцели   = 0;
	НовыйОстатокКошелька    = 0;
	
	ЭтоНакопления           = Ложь;
	ОбновлятьСуммы          = Объект.Ссылка.Пустая();
	
	Если Не ЗначениеЗаполнено(Объект.ОбъектУчета) Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТипЗнч(Объект.ОбъектУчета) = Тип("СправочникСсылка.Имущество") Тогда
		Счет = ПланыСчетов.РазделыУчета.Имущество;
	ИначеЕсли ТипЗнч(Объект.ОбъектУчета) = Тип("СправочникСсылка.Долги") Тогда
		Счет = ПланыСчетов.РазделыУчета.Долги;
	Иначе
		Счет = ПланыСчетов.РазделыУчета.Деньги;
		ЭтоНакопления = ТипЗнч(Объект.ОбъектУчета) = Тип("СправочникСсылка.КошелькиИСчета") И Объект.ОбъектУчета.ИспользоватьДляНакоплений;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Субконто",        Объект.ОбъектУчета);
	Запрос.УстановитьПараметр("ФинансоваяЦель",  Объект.ФинансоваяЦель);
	Запрос.УстановитьПараметр("Счет",            Счет);
	Запрос.УстановитьПараметр("Период",          ?(Объект.Проведен И Не Модифицированность, 
											Объект.Ссылка.МоментВремени(), КонецДня(ТекущаяДатаСеанса())));
												
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	жОстатки.Счет КАК Счет,
	|	жОстатки.ВалютнаяСуммаНачальныйОстаток КАК Остаток
	|ИЗ
	|	РегистрБухгалтерии.ЖурналОпераций.ОстаткиИОбороты(&Период, &Период, Период, ДвиженияИГраницыПериода, Счет В ИЕРАРХИИ (&Счет), , Субконто1 = &Субконто) КАК жОстатки
	|
	|";
	
	Если ЭтоНакопления Тогда
		
		Запрос.Текст = 	Запрос.Текст + "
		|;
		|
		|////////////////////////////////////////////
		|" + 
		"ВЫБРАТЬ
		|	жОстатки.Счет КАК Счет,
		|	жОстатки.ВалютнаяСуммаНачальныйОстаток КАК Остаток
		|ИЗ
		|	РегистрБухгалтерии.ЖурналОпераций.ОстаткиИОбороты(&Период, &Период, Период, ДвиженияИГраницыПериода, Счет В ИЕРАРХИИ (&Счет), , Субконто1 = &Субконто И Субконто2 = &ФинансоваяЦель) КАК жОстатки
		|
		|";
		
	КонецЕсли;
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	Выборка = ПакетРезультатов[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Счет = ПланыСчетов.РазделыУчета.ПроцентыПоДолгам Тогда
			ТекущийОстатокПроцентов = ?(Выборка.Остаток = NULL, 0, Выборка.Остаток);
		ИначеЕсли ЗначениеЗаполнено(Выборка.Счет) Тогда
			ТекущийОстаток = ?(Выборка.Остаток = NULL, 0, Выборка.Остаток);
		КонецЕсли; 
	КонецЦикла; 
	
	Если ЭтоНакопления Тогда
		Выборка = ПакетРезультатов[1].Выбрать();
		Если Выборка.Следующий() Тогда
			ТекущийОстатокФинцели = ?(Выборка.Остаток = NULL, 0, Выборка.Остаток);
		КонецЕсли;
	КонецЕсли;
	
	Если ОбновлятьСуммы Тогда
		Объект.СуммаНовогоОстаткаПроцентов = ТекущийОстатокПроцентов;
		Объект.СуммаНовогоОстатка          = ?(ЭтоНакопления, ТекущийОстатокФинцели, ТекущийОстаток);
	КонецЕсли;
	
	НовыйОстатокКошелька   = ТекущийОстаток + Объект.СуммаНовогоОстатка - ТекущийОстатокФинцели;
	
	ОбновитьНадписиТекущихОстатков();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНадписиТекущихОстатков()

	ЭтоНакопления = ТипЗнч(Объект.ОбъектУчета) = Тип("СправочникСсылка.КошелькиИСчета") И Объект.ОбъектУчета.ИспользоватьДляНакоплений;
	
	Если Объект.Проведен И Не Модифицированность Тогда
		Если ЭтоНакопления Тогда
			ТекстОстатка    = НСтр("ru='Всего до изменения: %1 %2'");
		Иначе
			ТекстОстатка    = НСтр("ru='Остаток до изменения: %1 %2'");
		КонецЕсли;
	Иначе
		ТекстОстатка = НСтр("ru='Текущий остаток, всего: %1 %2'");
	КонецЕсли;
	
	ТекстОстатка = СтрШаблон(ТекстОстатка, ТекущийОстаток, ВалютаОперации);
	Элементы.ТекстОстатка.Заголовок  = ТекстОстатка;
	Элементы.ТекстОстатка.ЦветТекста = ?(ТекущийОстаток < 0, ЦветаСтиля.ЦветОтрицательногоЧисла, ЦветаСтиля.ИнформационнаяНадписьЦвет);
	
	Если ЭтоНакопления Тогда
		ТекстНакоплений = НСтр("ru='по фин.цели: %1 %2'");
		ТекстНакоплений = СтрШаблон(ТекстНакоплений, ТекущийОстатокФинцели, ВалютаОперации);
		Элементы.ТекстОстаткаФинцели.Заголовок  = ТекстНакоплений;
		Элементы.ТекстОстаткаФинцели.ЦветТекста = ?(ТекущийОстатокФинцели < 0, ЦветаСтиля.ЦветОтрицательногоЧисла, ЦветаСтиля.ИнформационнаяНадписьЦвет);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ФинансоваяЦельКошелька(Кошелек)

	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Кошелек", Кошелек);
	Запрос.УстановитьПараметр("Период", КонецДня(ТекущаяДатаКлиентСервер()));
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	ЖурналОперацийОстатки.Субконто2,
	|	ЖурналОперацийОстатки.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаОстаток
	|ИЗ
	|	РегистрБухгалтерии.ЖурналОпераций.Остатки(&Период, Счет = ЗНАЧЕНИЕ(ПланСчетов.РазделыУчета.Накопления), , Субконто1 = &Кошелек) КАК ЖурналОперацийОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВалютнаяСуммаОстаток";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Субконто2;
	КонецЕсли;
	Возврат ?(ЗначениеЗаполнено(Результат), Результат, Справочники.ФинансовыеЦели.ОбщиеНакопления);

КонецФункции


&НаКлиентеНаСервереБезКонтекста
Функция ТекущаяДатаКлиентСервер()
	#Если Сервер Или ВнешнееСоединение Тогда
		Возврат ТекущаяДатаСеанса();
	#Иначе
		Возврат ОбщегоНазначенияКлиент.ДатаСеанса();
	#КонецЕсли 
КонецФункции 

#КонецОбласти
